Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/eusci_spi.c
        assert((EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_HIGH == param->clockPolarity) ||
               (EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_LOW == param->clockPolarity)
               );

        assert(
                (EUSCI_SPI_3PIN == param->spiMode) ||
                (EUSCI_SPI_4PIN_UCxSTE_ACTIVE_HIGH == param->spiMode) ||
                (EUSCI_SPI_4PIN_UCxSTE_ACTIVE_LOW == param->spiMode)
                );

        //Disable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCSWRST;

        //Reset OFS_UCAxCTLW0 values
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~(UCCKPH + UCCKPL + UC7BIT + UCMSB +
                                                  UCMST + UCMODE_3 + UCSYNC);

        //Reset OFS_UCAxCTLW0 values
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~(UCSSEL_3);

        //Select Clock
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= param->selectClockSource;

        HWREG16(baseAddress + OFS_UCAxBRW) =
                (uint16_t)(param->clockSourceFrequency / param->desiredSpiClock);

        /*
         * Configure as SPI master mode.
         * Clock phase select, polarity, msb
         * UCMST = Master mode
         * UCSYNC = Synchronous mode
         * UCMODE_0 = 3-pin SPI
         */
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= (
                param->msbFirst +
                param->clockPhase +
                param->clockPolarity +
                UCMST +
                UCSYNC +
                param->spiMode
                );
        //No modulation
        HWREG16(baseAddress + OFS_UCAxMCTLW) = 0;
}

//*****************************************************************************
//
//! \brief Selects 4Pin Functionality
//!
//! This function should be invoked only in 4-wire mode. Invoking this function
//! has no effect in 3-wire mode.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//! \param select4PinFunctionality selects 4 pin functionality
//!        Valid values are:
//!        - \b EUSCI_SPI_PREVENT_CONFLICTS_WITH_OTHER_MASTERS
//!        - \b EUSCI_SPI_ENABLE_SIGNAL_FOR_4WIRE_SLAVE
//!
//! Modified bits are \b UCSTEM of \b UCAxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_SPI_select4PinFunctionality(uint16_t baseAddress,
                                       uint8_t select4PinFunctionality
                                       )
{
        assert(  (EUSCI_SPI_PREVENT_CONFLICTS_WITH_OTHER_MASTERS == select4PinFunctionality) ||
                 (EUSCI_SPI_ENABLE_SIGNAL_FOR_4WIRE_SLAVE == select4PinFunctionality)
                 );

        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCSTEM;
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= select4PinFunctionality;
}

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the SPI Master clock. At the end of this
//! function call, SPI module is left enabled.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//! \param clockSourceFrequency is the frequency of the selected clock source
//! \param desiredSpiClock is the desired clock rate for SPI communication
//!
//! Modified bits are \b UCSWRST of \b UCAxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_SPI_masterChangeClock(uint16_t baseAddress,
                                 uint32_t clockSourceFrequency,
                                 uint32_t desiredSpiClock
                                 )
{
        EUSCI_SPI_changeMasterClockParam param = { 0 };

        param.clockSourceFrequency = clockSourceFrequency;
        param.desiredSpiClock = desiredSpiClock;
        EUSCI_SPI_changeMasterClock(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes the SPI Master clock. At the end of this function call,
//! SPI module is left enabled.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//! \param param is the pointer to struct for master clock setting.
//!
//! Modified bits are \b UCSWRST of \b UCAxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_SPI_changeMasterClock(uint16_t baseAddress,
                                 EUSCI_SPI_changeMasterClockParam *param)
{
        assert(param != 0);

        //Disable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCSWRST;

        HWREG16(baseAddress + OFS_UCAxBRW) =
                (uint16_t)(param->clockSourceFrequency / param->desiredSpiClock);

        //Reset the UCSWRST bit to enable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~(UCSWRST);
}
//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the SPI Slave block.
//!
//! Upon successful initialization of the SPI slave block, this function will
//! have initialized the slave block, but the SPI Slave block still remains
//! disabled and must be enabled with EUSCI_SPI_enable()
//!
//! \param baseAddress is the base address of the EUSCI_SPI Slave module.
//! \param msbFirst controls the direction of the receive and transmit shift
//!        register.
//!        Valid values are:
//!        - \b EUSCI_SPI_MSB_FIRST
//!        - \b EUSCI_SPI_LSB_FIRST [Default]
//! \param clockPhase is clock phase select.
//!        Valid values are:
//!        - \b EUSCI_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT [Default]
//!        - \b EUSCI_SPI_PHASE_DATA_CAPTURED_ONFIRST_CHANGED_ON_NEXT
//! \param clockPolarity is clock polarity select
//!        Valid values are:
//!        - \b EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_HIGH
//!        - \b EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_LOW [Default]
//! \param spiMode is SPI mode select
//!        Valid values are:
//!        - \b EUSCI_SPI_3PIN
//!        - \b EUSCI_SPI_4PIN_UCxSTE_ACTIVE_HIGH
//!        - \b EUSCI_SPI_4PIN_UCxSTE_ACTIVE_LOW
//!
//! Modified bits are \b UCMSB, \b UCMST, \b UC7BIT, \b UCCKPL, \b UCCKPH, \b
//! UCMODE and \b UCSWRST of \b UCAxCTLW0 register.
//!
//! \return STATUS_SUCCESS
//
//*****************************************************************************
void EUSCI_SPI_slaveInit(uint16_t baseAddress,
                         uint16_t msbFirst,
                         uint16_t clockPhase,
                         uint16_t clockPolarity,
                         uint16_t spiMode
                         )
{
        EUSCI_SPI_initSlaveParam param = { 0 };

