Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/eusci_spi.c
        param.msbFirst = msbFirst;
        param.clockPhase = clockPhase;
        param.clockPolarity = clockPolarity;
        param.spiMode = spiMode;

        EUSCI_SPI_initSlave(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes the SPI Slave block.
//!
//! Upon successful initialization of the SPI slave block, this function will
//! have initialized the slave block, but the SPI Slave block still remains
//! disabled and must be enabled with EUSCI_SPI_enable()
//!
//! \param baseAddress is the base address of the EUSCI_SPI Slave module.
//! \param param is the pointer to struct for slave initialization.
//!
//! Modified bits are \b UCMSB, \b UCMST, \b UC7BIT, \b UCCKPL, \b UCCKPH, \b
//! UCMODE and \b UCSWRST of \b UCAxCTLW0 register.
//!
//! \return STATUS_SUCCESS
//
//*****************************************************************************
void EUSCI_SPI_initSlave(uint16_t baseAddress, EUSCI_SPI_initSlaveParam *param)
{
        assert(param != 0);

        assert(
                (EUSCI_SPI_MSB_FIRST == param->msbFirst) ||
                (EUSCI_SPI_LSB_FIRST == param->msbFirst)
                );

        assert(
                (EUSCI_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT == param->clockPhase) ||
                (EUSCI_SPI_PHASE_DATA_CAPTURED_ONFIRST_CHANGED_ON_NEXT == param->clockPhase)
                );

        assert(
                (EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_HIGH == param->clockPolarity) ||
                (EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_LOW == param->clockPolarity)
                );

        assert(
                (EUSCI_SPI_3PIN == param->spiMode) ||
                (EUSCI_SPI_4PIN_UCxSTE_ACTIVE_HIGH == param->spiMode) ||
                (EUSCI_SPI_4PIN_UCxSTE_ACTIVE_LOW == param->spiMode)
                );

        //Disable USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0)  |= UCSWRST;

        //Reset OFS_UCAxCTLW0 register
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~(UCMSB +
                                                  UC7BIT +
                                                  UCMST +
                                                  UCCKPL +
                                                  UCCKPH +
                                                  UCMODE_3
                                                  );

        //Clock polarity, phase select, msbFirst, SYNC, Mode0
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= (param->clockPhase +
                                                 param->clockPolarity +
                                                 param->msbFirst +
                                                 UCSYNC +
                                                 param->spiMode
                                                 );
}

//*****************************************************************************
//
//! \brief Changes the SPI clock phase and polarity. At the end of this
//! function call, SPI module is left enabled.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//! \param clockPhase is clock phase select.
//!        Valid values are:
//!        - \b EUSCI_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT [Default]
//!        - \b EUSCI_SPI_PHASE_DATA_CAPTURED_ONFIRST_CHANGED_ON_NEXT
//! \param clockPolarity is clock polarity select
//!        Valid values are:
//!        - \b EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_HIGH
//!        - \b EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_LOW [Default]
//!
//! Modified bits are \b UCCKPL, \b UCCKPH and \b UCSWRST of \b UCAxCTLW0
//! register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_SPI_changeClockPhasePolarity(uint16_t baseAddress,
                                        uint16_t clockPhase,
                                        uint16_t clockPolarity
                                        )
{

        assert(  (EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_HIGH == clockPolarity) ||
                 (EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_LOW == clockPolarity)
                 );

        assert(  (EUSCI_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT == clockPhase) ||
                 (EUSCI_SPI_PHASE_DATA_CAPTURED_ONFIRST_CHANGED_ON_NEXT == clockPhase)
                 );

        //Disable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCSWRST;

        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~(UCCKPH + UCCKPL);

        HWREG16(baseAddress + OFS_UCAxCTLW0) |= (
                clockPhase +
                clockPolarity
                );

        //Reset the UCSWRST bit to enable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~(UCSWRST);
}

//*****************************************************************************
//
//! \brief Transmits a byte from the SPI Module.
//!
//! This function will place the supplied data into SPI transmit data register
//! to start transmission.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//! \param transmitData data to be transmitted from the SPI module
//!
//! \return None
//
//*****************************************************************************
void EUSCI_SPI_transmitData( uint16_t baseAddress,
                             uint8_t transmitData
                             )
{
        HWREG16(baseAddress + OFS_UCAxTXBUF) = transmitData;
}

//*****************************************************************************
//
//! \brief Receives a byte that has been sent to the SPI Module.
//!
//! This function reads a byte of data from the SPI receive data Register.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//!
//! \return Returns the byte received from by the SPI module, cast as an
//!         uint8_t.
//
//*****************************************************************************
uint8_t EUSCI_SPI_receiveData(uint16_t baseAddress)
{
        return HWREG16(baseAddress + OFS_UCAxRXBUF);
}

//*****************************************************************************
//
//! \brief Enables individual SPI interrupt sources.
//!
//! Enables the indicated SPI interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor. Does not clear interrupt flags.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//! \param mask is the bit mask of the interrupt sources to be enabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b EUSCI_SPI_TRANSMIT_INTERRUPT
//!        - \b EUSCI_SPI_RECEIVE_INTERRUPT
//!
//! Modified bits of \b UCAxIFG register and bits of \b UCAxIE register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_SPI_enableInterrupt(uint16_t baseAddress,
                               uint8_t mask
                               )
{
        assert(!(mask & ~(EUSCI_SPI_RECEIVE_INTERRUPT
                          | EUSCI_SPI_TRANSMIT_INTERRUPT)));

        HWREG16(baseAddress + OFS_UCAxIE) |= mask;
}

//*****************************************************************************
//
//! \brief Disables individual SPI interrupt sources.
//!
//! Disables the indicated SPI interrupt sources. Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//! \param mask is the bit mask of the interrupt sources to be disabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b EUSCI_SPI_TRANSMIT_INTERRUPT
//!        - \b EUSCI_SPI_RECEIVE_INTERRUPT
//!
//! Modified bits of \b UCAxIE register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_SPI_disableInterrupt(uint16_t baseAddress,
                                uint8_t mask
                                )
{
        assert(!(mask & ~(EUSCI_SPI_RECEIVE_INTERRUPT
                          | EUSCI_SPI_TRANSMIT_INTERRUPT)));

        HWREG16(baseAddress + OFS_UCAxIE) &= ~mask;
}

//*****************************************************************************
//
//! \brief Gets the current SPI interrupt status.
//!
//! This returns the interrupt status for the SPI module based on which flag is
//! passed.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//! \param mask is the masked interrupt flag status to be returned.
//!        Mask value is the logical OR of any of the following:
//!        - \b EUSCI_SPI_TRANSMIT_INTERRUPT
//!        - \b EUSCI_SPI_RECEIVE_INTERRUPT
//!
//! \return Logical OR of any of the following:
//!         - \b EUSCI_SPI_TRANSMIT_INTERRUPT
//!         - \b EUSCI_SPI_RECEIVE_INTERRUPT
//!         \n indicating the status of the masked interrupts
//
//*****************************************************************************
uint8_t EUSCI_SPI_getInterruptStatus(uint16_t baseAddress,
                                     uint8_t mask
                                     )
{
        assert(!(mask & ~(EUSCI_SPI_RECEIVE_INTERRUPT
                          | EUSCI_SPI_TRANSMIT_INTERRUPT)));

        return HWREG16(baseAddress + OFS_UCAxIFG) & mask;
}

//*****************************************************************************
//
//! \brief Clears the selected SPI interrupt status flag.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//! \param mask is the masked interrupt flag to be cleared.
//!        Mask value is the logical OR of any of the following:
//!        - \b EUSCI_SPI_TRANSMIT_INTERRUPT
//!        - \b EUSCI_SPI_RECEIVE_INTERRUPT
//!
//! Modified bits of \b UCAxIFG register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_SPI_clearInterruptFlag(uint16_t baseAddress,
                                  uint8_t mask
                                  )
{
        assert(!(mask & ~(EUSCI_SPI_RECEIVE_INTERRUPT
                          | EUSCI_SPI_TRANSMIT_INTERRUPT)));

        HWREG16(baseAddress + OFS_UCAxIFG) &=  ~mask;
}

//*****************************************************************************
//
//! \brief Enables the SPI block.
//!
//! This will enable operation of the SPI block.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//!
//! Modified bits are \b UCSWRST of \b UCAxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_SPI_enable(uint16_t baseAddress)
{
        //Reset the UCSWRST bit to enable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~(UCSWRST);
}

//*****************************************************************************
//
//! \brief Disables the SPI block.
//!
//! This will disable operation of the SPI block.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//!
//! Modified bits are \b UCSWRST of \b UCAxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_SPI_disable(uint16_t baseAddress)
{
        //Set the UCSWRST bit to disable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCSWRST;
}

//*****************************************************************************
//
//! \brief Returns the address of the RX Buffer of the SPI for the DMA module.
//!
//! Returns the address of the SPI RX Buffer. This can be used in conjunction
//! with the DMA to store the received data directly to memory.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//!
//! \return the address of the RX Buffer
//
//*****************************************************************************
uint32_t EUSCI_SPI_getReceiveBufferAddress(uint16_t baseAddress)
{
        return baseAddress + OFS_UCAxRXBUF;
}

//*****************************************************************************
//
//! \brief Returns the address of the TX Buffer of the SPI for the DMA module.
//!
//! Returns the address of the SPI TX Buffer. This can be used in conjunction
//! with the DMA to obtain transmitted data directly from memory.
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//!
//! \return the address of the TX Buffer
//
//*****************************************************************************
uint32_t EUSCI_SPI_getTransmitBufferAddress(uint16_t baseAddress)
{
        return baseAddress + OFS_UCAxTXBUF;
}

//*****************************************************************************
//
//! \brief Indicates whether or not the SPI bus is busy.
//!
//! This function returns an indication of whether or not the SPI bus is
//! busy.This function checks the status of the bus via UCBBUSY bit
//!
//! \param baseAddress is the base address of the EUSCI_SPI module.
//!
//! \return One of the following:
//!         - \b EUSCI_SPI_BUSY
//!         - \b EUSCI_SPI_NOT_BUSY
//!         \n indicating if the EUSCI_SPI is busy
//
//*****************************************************************************
uint16_t EUSCI_SPI_isBusy(uint16_t baseAddress)
{
        //Return the bus busy status.
        return HWREG16(baseAddress + OFS_UCAxSTATW) & UCBUSY;
}


#endif
//*****************************************************************************
//
//! Close the doxygen group for eusci_spi_api
//! @}
//
//*****************************************************************************
